sterentev/atdf-device-asm-include/inc/ATmega1284RFR2.inc
; ----------	Register XAH_CTRL_1 bits	------------------------
.equ	AACK_FLTR_RES_FT= 5		; 0x20 - Filter Reserved Frames
.equ	AACK_UPLD_RES_FT= 4		; 0x10 - Process Reserved Frames
.equ	AACK_ACK_TIME	= 2		; 0x04 - Reduce Acknowledgment Time
.equ	AACK_PROM_MODE	= 1		; 0x02 - Enable Promiscuous Mode
; ::::  AACK_ACK_TIME	:::: bitfield values
;			0x00		; 12 symbols acknowledgment time
;			0x04		;  2 symbols acknowledgment time

; ----------	Register FTN_CTRL bits		------------------------
.equ	FTN_START	= 7		; 0x80 - Start Calibration Loop of Filter Tuning Network

; ----------	Register PLL_CF bits		------------------------
.equ	PLL_CF_START	= 7		; 0x80 - Start Center Frequency Calibration

; ----------	Register PLL_DCU bits		------------------------
.equ	PLL_DCU_START	= 7		; 0x80 - Start Delay Cell Calibration

; ----------	Register PART_NUM bits		------------------------
.equ	PART_NUM_MASK	= 0xFF		;      - Part Number (8 bits)
.equ	PART_NUM0	= 0		;          PART_NUM BIT0 position
; ::::  PART_NUM	:::: bitfield values
;			0x83		; ATmega128RFA1 part number
;			0x93		; RFA2 family
;			0x94		; RFR2 family

; ----------	Register VERSION_NUM bits	------------------------
.equ	VERSION_NUM_MASK= 0xFF		;      - Version Number (8 bits)
.equ	VERSION_NUM0	= 0		;          VERSION_NUM BIT0 position
; ::::  VERSION_NUM	:::: bitfield values
;			0x0C		; Revision A
;			0x01		; Revision B
;			0x03		; Revision C
;			0x04		; Revision D

; ----------	Register MAN_ID_0 bits		------------------------
.equ	MAN_ID_07	= 7		; 0x80 - Manufacturer ID (Low Byte)
.equ	MAN_ID_06	= 6		; 0x40 - Manufacturer ID (Low Byte)
.equ	MAN_ID_05	= 5		; 0x20 - Manufacturer ID (Low Byte)
.equ	MAN_ID_04	= 4		; 0x10 - Manufacturer ID (Low Byte)
.equ	MAN_ID_03	= 3		; 0x08 - Manufacturer ID (Low Byte)
.equ	MAN_ID_02	= 2		; 0x04 - Manufacturer ID (Low Byte)
.equ	MAN_ID_01	= 1		; 0x02 - Manufacturer ID (Low Byte)
.equ	MAN_ID_00	= 0		; 0x01 - Manufacturer ID (Low Byte)
; ::::  MAN_ID_00	:::: bitfield values
;			0x01		; Atmel JEDEC manufacturer ID, bits [7:0] of 32 bit manufacturer ID: 00 00 00 1F

; ----------	Register MAN_ID_1 bits		------------------------
.equ	MAN_ID__MASK	= 0xFF		;      - Manufacturer ID (High Byte) (8 bits)
;.equ	MAN_ID_0	= 0		;          MAN_ID_ BIT0 position
; ::::  MAN_ID_	:::: bitfield values
;			0x00		; Atmel JEDEC manufacturer ID, bits [15:8] of 32 bit manufacturer ID: 00 00 00 1F

; ----------	Register SHORT_ADDR_0 bits	------------------------
.equ	SHORT_ADDR_07	= 7		; 0x80 - MAC Short Address
.equ	SHORT_ADDR_06	= 6		; 0x40 - MAC Short Address
.equ	SHORT_ADDR_05	= 5		; 0x20 - MAC Short Address
.equ	SHORT_ADDR_04	= 4		; 0x10 - MAC Short Address
.equ	SHORT_ADDR_03	= 3		; 0x08 - MAC Short Address
.equ	SHORT_ADDR_02	= 2		; 0x04 - MAC Short Address
.equ	SHORT_ADDR_01	= 1		; 0x02 - MAC Short Address
.equ	SHORT_ADDR_00	= 0		; 0x01 - MAC Short Address

; ----------	Register SHORT_ADDR_1 bits	------------------------
.equ	SHORT_ADDR__MASK= 0xFF		;      - MAC Short Address (8 bits)
;.equ	SHORT_ADDR_0	= 0		;          SHORT_ADDR_ BIT0 position

; ----------	Register PAN_ID_0 bits		------------------------
.equ	PAN_ID_07	= 7		; 0x80 - MAC Personal Area Network ID
.equ	PAN_ID_06	= 6		; 0x40 - MAC Personal Area Network ID
.equ	PAN_ID_05	= 5		; 0x20 - MAC Personal Area Network ID
.equ	PAN_ID_04	= 4		; 0x10 - MAC Personal Area Network ID
.equ	PAN_ID_03	= 3		; 0x08 - MAC Personal Area Network ID
.equ	PAN_ID_02	= 2		; 0x04 - MAC Personal Area Network ID
.equ	PAN_ID_01	= 1		; 0x02 - MAC Personal Area Network ID
.equ	PAN_ID_00	= 0		; 0x01 - MAC Personal Area Network ID

; ----------	Register PAN_ID_1 bits		------------------------
.equ	PAN_ID__MASK	= 0xFF		;      - MAC Personal Area Network ID (8 bits)
;.equ	PAN_ID_0	= 0		;          PAN_ID_ BIT0 position

; ----------	Register IEEE_ADDR_0 bits	------------------------
.equ	IEEE_ADDR_07	= 7		; 0x80 - MAC IEEE Address
.equ	IEEE_ADDR_06	= 6		; 0x40 - MAC IEEE Address
.equ	IEEE_ADDR_05	= 5		; 0x20 - MAC IEEE Address
.equ	IEEE_ADDR_04	= 4		; 0x10 - MAC IEEE Address
.equ	IEEE_ADDR_03	= 3		; 0x08 - MAC IEEE Address
.equ	IEEE_ADDR_02	= 2		; 0x04 - MAC IEEE Address
.equ	IEEE_ADDR_01	= 1		; 0x02 - MAC IEEE Address
.equ	IEEE_ADDR_00	= 0		; 0x01 - MAC IEEE Address

; ----------	Register IEEE_ADDR_1 bits	------------------------
.equ	IEEE_ADDR__MASK	= 0xFF		;      - MAC IEEE Address (8 bits)
;.equ	IEEE_ADDR_0	= 0		;          IEEE_ADDR_ BIT0 position

; ----------	Register IEEE_ADDR_2 bits	------------------------
;.equ	IEEE_ADDR__MASK	= 0xFF		;      - MAC IEEE Address (8 bits)
;.equ	IEEE_ADDR_0	= 0		;          IEEE_ADDR_ BIT0 position

; ----------	Register IEEE_ADDR_3 bits	------------------------
;.equ	IEEE_ADDR__MASK	= 0xFF		;      - MAC IEEE Address (8 bits)
;.equ	IEEE_ADDR_0	= 0		;          IEEE_ADDR_ BIT0 position

; ----------	Register IEEE_ADDR_4 bits	------------------------
;.equ	IEEE_ADDR__MASK	= 0xFF		;      - MAC IEEE Address (8 bits)
;.equ	IEEE_ADDR_0	= 0		;          IEEE_ADDR_ BIT0 position

; ----------	Register IEEE_ADDR_5 bits	------------------------
;.equ	IEEE_ADDR__MASK	= 0xFF		;      - MAC IEEE Address (8 bits)
;.equ	IEEE_ADDR_0	= 0		;          IEEE_ADDR_ BIT0 position

; ----------	Register IEEE_ADDR_6 bits	------------------------
;.equ	IEEE_ADDR__MASK	= 0xFF		;      - MAC IEEE Address (8 bits)
;.equ	IEEE_ADDR_0	= 0		;          IEEE_ADDR_ BIT0 position

; ----------	Register IEEE_ADDR_7 bits	------------------------
;.equ	IEEE_ADDR__MASK	= 0xFF		;      - MAC IEEE Address (8 bits)
;.equ	IEEE_ADDR_0	= 0		;          IEEE_ADDR_ BIT0 position

; ----------	Register XAH_CTRL_0 bits	------------------------
.equ	MAX_FRAME_RETRIES_MASK= 0xF0		;      - Maximum Number of Frame Re-transmission Attempts (4 bits)
.equ	MAX_FRAME_RETRIES0= 4		;          MAX_FRAME_RETRIES BIT0 position
.equ	MAX_CSMA_RETRIES_MASK= 0x0E		;      - Maximum Number of CSMA-CA Procedure Repetition Attempts (3 bits)
.equ	MAX_CSMA_RETRIES0= 1		;          MAX_CSMA_RETRIES BIT0 position
.equ	SLOTTED_OPERATION= 0		; 0x01 - Set Slotted Acknowledgment
; ::::  MAX_FRAME_RETRIES	:::: bitfield values
;			0x00		; Retransmission of frame is not attempted.
;			0x10		; Retransmission of frame is attempted once.
;			0x20		; ...
;			0xF0		; Retransmission of frame is attempted 15 times.
; ::::  MAX_CSMA_RETRIES	:::: bitfield values
;			0x00		; No repetition of CSMA-CA procedure
;			0x02		; One repetition of CSMA-CA procedure
;			0x04		; ...
;			0x0A		; Five repetitions (highest IEEE 802.15.4 compliant value)
;			0x0C		; Reserved
;			0x0E		; Immediate frame re-transmission without performing CSMA-CA
; ::::  SLOTTED_OPERATION	:::: bitfield values
;			0x00		; The radio transceiver operates in unslotted mode. An acknowledgment frame is automatically sent if requested.
;			0x01		; The transmission of an acknowledgment frame has to be controlled by the microcontroller.

; ----------	Register CSMA_SEED_0 bits	------------------------
.equ	CSMA_SEED_07	= 7		; 0x80 - Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_06	= 6		; 0x40 - Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_05	= 5		; 0x20 - Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_04	= 4		; 0x10 - Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_03	= 3		; 0x08 - Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_02	= 2		; 0x04 - Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_01	= 1		; 0x02 - Seed Value for CSMA Random Number Generator
.equ	CSMA_SEED_00	= 0		; 0x01 - Seed Value for CSMA Random Number Generator

